[
  {
    "id": 1,
    "name": "Tanya Nancarrow",
    "role": "Director, Development",
    "pronouns": "She/Her",
    "photo": "http://localhost:8080/images/board_photos/TNancarrow.jpg",
    "description": ""
  },
  {
    "id": 2,
    "name": "Stephanie Sutherland",
    "role": "Secretary",
    "pronouns": "She/Her",
    "photo": "http://localhost:8080/images/board_photos/SSutherland.jpg",
    "description": "Stephanie is a condominium and multi-residential lawyer, assisting clients across Ontario with the various issues that arise when people live in close proximity to each other, and promoting healthy and functional communities. She is an active community volunteer, sitting on the Board and as Secretary of tri-Pride Community Association Inc., on the EDI, CPD, and POWROUT Committees of the Waterloo Region Law Association, and on various condominium industry Boards and committees. In May 2023, Stephanie was elected as a Bencher to the Law Society of Ontario, for the 2023-2027 term. A proud member of the 2SLGBTQIIA+ community, Stephanie helped to co-found POWROUT, a Waterloo Region Law Association committee for 2SLGBTQIIA+ lawyers, paralegals, and law students, and now sits as Co-Chair of the Committee. Stephanie joined tri-Pride in March 2022, and is honoured to be a part of the work that tri-Pride does, particularly regarding the organisation’s work with other community partners and equity groups. In her spare time, Stephanie enjoys reading, knitting, having political discussions, and spending time with her family and friends, including her partner and her step-son and their many animals (especially their dogs, Leia and Vada!)"
  },
  {
    "id": 3,
    "name": "Sam Spizzirri",
    "role": "Vice President",
    "pronouns": "They/Them",
    "photo": "http://localhost:8080/images/board_photos/SSpizzirri.jpg",
    "description": "Sam Spizzirri (they/them) is a queer-identifying community member and advocate for 2SLGBTQIIA+ communities within Waterloo Region. Sam has been living and working within the region for almost 10 years now, bringing a passion for advocacy work and community development. Starting off their career in the nonprofit sector, Sam worked as a support worker and advocate for those living with HIV in the community. It was in this work that Sam became connected to tri-Pride and was able to further their passion doing advocacy work specifically with 2SLGBTQIIA+ communities in the region. Currently, Sam works as the student-run Services Manager with the University of Waterloo’s Undergraduate Student Association, supporting students in similar community development within the University, while also sitting as the Vice President of the Board for tri-Pride Community Association. Outside of their active community work and engagement, Sam enjoys exploring new places in and around the region, especially areas close to water, alongside their friends and chosen family that has been created through their community work."
  },
  {
    "id": 4,
    "name": "Karen Nancarrow",
    "role": "Director, Volunteers and Community Engagement",
    "pronouns": "She/Her",
    "photo": "http://localhost:8080/images/board_photos/KNancarrow.jpg",
    "description": "Karen Nancarrow is a certified teacher, who worked for a local school board as a reading intervention specialist for 23 years.  She now works as a Professor and field placement supervisor at Conestoga College.  She also owns Indigo Tutoring & Consulting, a local tutoring company.  Karen is originally from Kitchener but has lived all over Canada in Nova Scotia, North West Territories and Newfoundland, and is now back in KW raising her family.  She joined the triPride Board of Directors in April 2023."
  },
  {
    "id": 5,
    "name": "Kamil Ahmed",
    "role": "Director, Entertainment",
    "pronouns": "He/Him",
    "photo": "http://localhost:8080/images/board_photos/KAhmed.jpg",
    "description": "Kamil (he/him) is a first-generation immigrant and settler from Pakistan who identifies with various communities including bisexual and Muslim. Passionate about mutual aid, resource distribution and building communities of care, Kamil is an organizer at Community Fridge KW. He is a photographer, facilitator, music enthusiast, vegetarian, and a big fan of farmers markets. As the Coordinator to CJI’s Sulah Program, Kamil has the pleasure of working with, and in service to community facilitating a restorative approach to hate crime and identity-based harm; an approach that offers opportunity to bridge divides, develop mutual understanding and enable capacity to build competent communities."
  },
  {
    "id": 6,
    "name": "Fabian Fletcher",
    "role": "President",
    "pronouns": "He/They",
    "photo": "http://localhost:8080/images/board_photos/FFletcher.jpg",
    "description": "Fabian Fletcher (he/they) is a queer-identified black community leader and advocate for 2SLGBTQIIA+ communities in Waterloo Region. Fabian brings with him a passion for community development and health equity for Black Indigenous and Racialized communities. Starting his career off with working in HIV prevention and education with GBMSM, Fabian developed a love for community involvement, and working within the nonprofit sector to address systemic harms and barriers marginalized communities face. Moving into community health care, Fabian worked at HQ Toronto, a sexual health clinic aimed at providing culturally competent and accessible health services for guys into guys and trans and non-binary folks, providing operational support and overseeing the day-to-day clinical operations. Currently, Fabian works as the Volunteer and Operations Manager for Spectrum, Waterloo Region's Rainbow Community Space, and sits as President of the Board for tri-Pride Community Association. In their free time, Fabian enjoys dining out and trying new restaurants, baking, and spending quality time with his friends and chosen family."
  },
  {
    "id": 7,
    "name": "Lucas Chegano",
    "role": "Director, Vendor Marketplace",
    "pronouns": "He/Him",
    "photo": "http://localhost:8080/images/board_photos/LChegano.jpeg",
    "description": "Lucas Chegahno is an Undergraduate at Wilfrid Laurier University, studying Political Science, Math, and Economics. Lucas is a queer Indigenous man, originally from Wiarton, Ontario and indigenous to Neyaashiinigmiing, Chippewas of Nawash Unceded First Nations. When he lived in Wiarton he was actively involved in student government and other volunteer opportunities, he served as a self-identified indigenous student trustee on the board of trustees at his school board, he was a general assembly member of OSTA-AECO, and he volunteered as a youth liaison in the mental health sector for his area. Lucas joined the tri-Pride team in August of 2023 and is thrilled to be working with the group."
  },
  {
    "id": 8,
    "name": "S Creighton",
    "role": "Treasurer",
    "pronouns": "",
    "photo": "",
    "description": ""
  },
  {
    "id": 9,
    "name": "Paloma Gonzales",
    "role": "Director, Operations",
    "pronouns": "She/Her",
    "photo": "http://localhost:8080/images/board_photos/PGonzales.jpeg",
    "description": ""
  }
]
